In [44]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import make_column_transformer,make_column_selector
from sklearn.impute import SimpleImputer
from sklearn.pipeline import make_pipeline

In [45]:
#load dataset
data = pd.read_csv("http://bit.ly/kaggletrain", nrows=100)

In [46]:
data.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [47]:
# we declare the target column
y = data.Survived

In [48]:
#we need four column
columns = ["Fare","Embarked","Sex","Age"]
data = data[columns]

In [49]:
data.head(7)

      Fare Embarked     Sex   Age
0   7.2500        S    male  22.0
1  71.2833        C  female  38.0
2   7.9250        S  female  26.0
3  53.1000        S  female  35.0
4   8.0500        S    male  35.0
5   8.4583        Q    male   NaN
6  51.8625        S    male  54.0

In [50]:
# create the objects
ohe = OneHotEncoder()
imp = SimpleImputer()

In [51]:
#assingment  the make column transformer
m_ct = make_column_transformer((ohe,["Embarked","Sex"]),(imp,["Age"]),remainder="passthrough")

In [55]:
#Load model and create pipline
from sklearn.linear_model import LogisticRegression

model = make_pipeline(m_ct,LogisticRegression())

In [56]:
# Split the dataset
from sklearn.model_selection import train_test_split

X_train, X_test, y_train,y_test = train_test_split(data,y, test_size = 0.5, random_state = 0, stratify = y)

In [57]:
#Fit the model
model.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(),
                                                  ['Embarked', 'Sex']),
                                                 ('simpleimputer',
                                                  SimpleImputer(), ['Age'])])),
                ('logisticregression', LogisticRegression())])

In [58]:
#Predict with X_test
predict = model.predict(X_test)

In [59]:
# Using accuracy score for metric
from sklearn.metrics import accuracy_score

print(accuracy_score(y_test,predict))

0.88